tutorials/myLusgsFoam/oscillating_NACA0012/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    freestream
    {
      type fixedValue;
      value           $internalField;
    }

    outlet
    {
      type            fixedValue;
        value           $internalField;
    }

    airfoil
    {
      type angularOscillatingDisplacement;
      omega 39.971; 
      axis (0 0 1);
      origin (0.25 0 0);
      angle0 2.79252680319093e-04;
      amplitude 0.0438077642250577;
      value uniform (0 0 0);
   }

}

// ************************************************************************* //
