tutorials/myLusgsFoam/oscillating_NACA0012/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("libmyFoam.so");

application     myLusgsFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.157193413007367e1;

deltaT          0.157193413007367e-2;

writeControl    timeStep;

writeInterval   1;

purgeWrite      100;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           1000;

maxDeltaT       0.16e-2;

rDeltaTauSmoothingCoeff 0.1;

functions
{
  #includeFunc "forcesCompressible"
  #includeFunc "forceCoeffsCompressible"
  #includeFunc "MachNo"
  #includeFunc "surfaces"
}
// ************************************************************************* //
