tutorials/myLusgsFoam/oscillating_NACA0012/system/forcesCompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2212
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is compressible (pressure is in units M/(LT^2), e.g. Pa).

\*---------------------------------------------------------------------------*/

patches     (airfoil);

CofR        (0.25 0 0);
pitchAxis   (0 0 1);

#includeEtc "caseDicts/postProcessing/forces/forces.cfg"

// ************************************************************************* //
