tutorials/myLusgsFoam/oscillating_NACA0012/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dbnsFlux hllcLMFlux;

//dbnsFlux AUSMplusUpFlux;
//dbnsFlux hllcFlux;
//dbnsFlux roeFlux;

AUSMplusUpFluxCoeffs {
   MaInf 0.2;
   printCoeffs true;
}

ddtSchemes
{
 default         backward;
}

gradSchemes
{
    default         Gauss linear;
    limitedGauss    cellLimited Gauss linear 1;
    limitedLSQR     cellLimited leastSquares 1;
    venkatakrishnan cellLimited<Venkatakrishnan> Gauss linear 1;
}

divSchemes
{
    default         none;
    div(phi,k)      Gauss linearUpwind limitedGauss;
    div(phi,omega)  Gauss linearUpwind limitedGauss;
    div(devRhoReff) Gauss linear;
    div((devRhoReff&U)) Gauss linear;
}

laplacianSchemes
{
   default         Gauss linear corrected;
}

interpolationSchemes
{
    default        linear;
    reconstruct(p) linearUpwind  venkatakrishnan; //upwind;
    reconstruct(U) linearUpwindV venkatakrishnan; //upwind;
    reconstruct(T) linearUpwind  venkatakrishnan; //upwind;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
}

wallDist {
  method Poisson;
}

// ************************************************************************* //
